Test/risultatiHEY/1000/WasmEdge1000AOT.txt
hey -n 1000 http://0.0.0.0:8080

Summary:
  Total:        0.0691 secs
  Slowest:      0.0123 secs
  Fastest:      0.0001 secs
  Average:      0.0033 secs
  Requests/sec: 14480.8961

  Total data:   6000 bytes
  Size/request: 6 bytes

Response time histogram:
  0.000 [1]     |
  0.001 [18]    |■■
  0.003 [432]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [312]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [127]   |■■■■■■■■■■■■
  0.006 [54]    |■■■■■
  0.007 [8]     |■
  0.009 [9]     |■
  0.010 [21]    |■■
  0.011 [10]    |■
  0.012 [8]     |■


Latency distribution:
  10% in 0.0022 secs
  25% in 0.0024 secs
  50% in 0.0026 secs
  75% in 0.0032 secs
  90% in 0.0050 secs
  95% in 0.0071 secs
  99% in 0.0110 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0001 secs, 0.0001 secs, 0.0123 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:    0.0031 secs, 0.0001 secs, 0.0103 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0022 secs

Status code distribution:
  [200] 1000 responses