Test/risultatiHEY/1000/Wasmtime1000AOT.txt
hey -n 1000 http://0.0.0.0:8080

Summary:
  Total:        0.1423 secs
  Slowest:      0.0246 secs
  Fastest:      0.0002 secs
  Average:      0.0067 secs
  Requests/sec: 7029.5558


Response time histogram:
  0.000 [1]     |
  0.003 [71]    |■■■■■■■■
  0.005 [239]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [349]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [221]   |■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [76]    |■■■■■■■■■
  0.015 [28]    |■■■
  0.017 [7]     |■
  0.020 [3]     |
  0.022 [2]     |
  0.025 [3]     |


Latency distribution:
  10% in 0.0030 secs
  25% in 0.0045 secs
  50% in 0.0064 secs
  75% in 0.0085 secs
  90% in 0.0103 secs
  95% in 0.0121 secs
  99% in 0.0163 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0001 secs, 0.0002 secs, 0.0246 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0019 secs
  resp wait:    0.0065 secs, 0.0002 secs, 0.0221 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0013 secs

Status code distribution:
  [200] 1000 responses